engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
#include "stm32f411xe.h"
#include "Unity/unity.h"

#include "drivers/adc_types.h"
#include "utils/common.h"
#include "drivers/adc.h"
#include "utils/board.h"
#include "test/adc.hpp"
#include "utils/err.h"
#include "utils/log.h"

#include <array>
#include <cstdint>
#include <utility>


namespace test::adc {

    namespace {

        constexpr const char* TAG = "ADC_Test";

        // Helpers
        void reset_to_baseline() {
            adc_clk_configure(ADC_CLK_PRESCALER_4);
            constexpr adc_config_t config = {
                .alignment       = ADC_RIGHT_ALIGN,
                .resolution      = ADC_RES_12_BITS,
                .sampling_cycles = ADC_SAMPLE_28_CYCLES,
            };
            TEST_ASSERT_EQUAL(HAL_OK, adc_configure(ADC1, &config));
        }

        volatile bool s_injected_done = false;
        void          injected_done_cb(void*) {
            s_injected_done = true;
        }

        volatile bool    s_cont_done         = false;
        volatile uint8_t s_filled_buffer_idx = 0;
        void             cont_done_cb(void*, uint8_t filled_buffer_idx) {
            s_filled_buffer_idx = filled_buffer_idx;
            s_cont_done         = true;
        }

        volatile bool s_wdg_triggered = false;
        void          wdg_cb(void*) {
            s_wdg_triggered = true;
        }

        template<typename predicate>
        bool wait_until(predicate pred) {
            uint32_t timeout = TIMEOUT;
            while (!pred() && --timeout);
            return pred();
        }

        // TESTS
        void clk_enable_rejects_unknown_handles() {
            TEST_ASSERT_EQUAL(HAL_OK, adcx_clk_enable(ADC1, true));
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_ADC1EN);

            const uint32_t before = RCC->APB2ENR;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adcx_clk_enable(nullptr, true));
            TEST_ASSERT_EQUAL_UINT32(before, RCC->APB2ENR);

            TEST_ASSERT_EQUAL(HAL_OK, adcx_clk_enable(ADC1, true)); // leave it enabled for every other test
        }

        void power_on_toggles_adon() {
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_power_on(nullptr, true));

            TEST_ASSERT_EQUAL(HAL_OK, adc_power_on(ADC1, true));
            TEST_ASSERT_TRUE(ADC1->CR2 & ADC_CR2_ADON);

            TEST_ASSERT_EQUAL(HAL_OK, adc_power_on(ADC1, false));
            TEST_ASSERT_FALSE(ADC1->CR2 & ADC_CR2_ADON);

            adc_power_on(ADC1, true);
        }

        void configure_covers_every_alignment_resolution_and_sample_time() {
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_configure(nullptr, nullptr));

            constexpr auto RESOLUTIONS = std::array{
                ADC_RES_6_BITS,
                ADC_RES_8_BITS,
                ADC_RES_10_BITS,
                ADC_RES_12_BITS,
            };
            constexpr auto SAMPLE_TIMES = std::array{
                ADC_SAMPLE_3_CYCLES,
                ADC_SAMPLE_15_CYCLES,
                ADC_SAMPLE_28_CYCLES,
                ADC_SAMPLE_56_CYCLES,
                ADC_SAMPLE_84_CYCLES,
                ADC_SAMPLE_112_CYCLES,
                ADC_SAMPLE_144_CYCLES,
                ADC_SAMPLE_480_CYCLES,
            };

            for (const auto resolution : RESOLUTIONS) {
                for (const auto time : SAMPLE_TIMES) {
                    const adc_config_t config{.alignment = ADC_LEFT_ALIGN, .resolution = resolution, .sampling_cycles = time};
                    TEST_ASSERT_EQUAL(HAL_OK, adc_configure(ADC1, &config));

                    TEST_ASSERT_TRUE(ADC1->CR2 & ADC_CR2_ALIGN);
                    TEST_ASSERT_EQUAL_UINT32(std::to_underlying(resolution), (ADC1->CR1 & ADC_CR1_RES) >> ADC_CR1_RES_Pos);

                    // Every external channel must carry the same sampling time
                    TEST_ASSERT_EQUAL_UINT32(std::to_underlying(time), (ADC1->SMPR1 >> ADC_SMPR1_SMP10_Pos) & 0b111UL);
                    TEST_ASSERT_EQUAL_UINT32(std::to_underlying(time), (ADC1->SMPR1 >> ADC_SMPR1_SMP15_Pos) & 0b111UL);
                    TEST_ASSERT_EQUAL_UINT32(std::to_underlying(time), (ADC1->SMPR2 >> ADC_SMPR2_SMP0_Pos) & 0b111UL);
                    TEST_ASSERT_EQUAL_UINT32(std::to_underlying(time), (ADC1->SMPR2 >> ADC_SMPR2_SMP9_Pos) & 0b111UL);
                }
            }

            constexpr adc_config_t right_align_config = {
                .alignment       = ADC_RIGHT_ALIGN,
                .resolution      = ADC_RES_12_BITS,
                .sampling_cycles = ADC_SAMPLE_28_CYCLES,
            };
            TEST_ASSERT_EQUAL(HAL_OK, adc_configure(ADC1, &right_align_config));
            TEST_ASSERT_FALSE(ADC1->CR2 & ADC_CR2_ALIGN);

            reset_to_baseline();
        }

        void deconfigure_powers_down_and_clears_state() {
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_deconfigure(nullptr));

            TEST_ASSERT_EQUAL(HAL_OK, adc_deconfigure(ADC1));
            TEST_ASSERT_FALSE(ADC1->CR2 & ADC_CR2_ADON);
            TEST_ASSERT_EQUAL_UINT32(0, ADC1->CR1 & ADC_CR1_RES);
            TEST_ASSERT_EQUAL_UINT32(0, ADC1->SMPR1);
            TEST_ASSERT_EQUAL_UINT32(0, ADC1->SMPR2);

            reset_to_baseline();
        }

        void clk_configure_sweeps_every_prescaler() {
            for (const auto prescaler : {ADC_CLK_PRESCALER_2, ADC_CLK_PRESCALER_4, ADC_CLK_PRESCALER_6, ADC_CLK_PRESCALER_8}) {
                adc_clk_configure(prescaler);
                TEST_ASSERT_EQUAL_UINT32(std::to_underlying(prescaler), (ADC->CCR & ADC_CCR_ADCPRE) >> ADC_CCR_ADCPRE_Pos);
            }
            adc_clk_configure(ADC_CLK_PRESCALER_4);
        }

        void nvic_irq_enable_toggles_the_adc_line() {
            auto irq_is_enabled = []() {
                return (NVIC->ISER[std::to_underlying(ADC_IRQn) >> 5] & (1UL << (std::to_underlying(ADC_IRQn) & 0x1FU))) != 0;
            };

            adc_enable_nvic_irq(true);
            TEST_ASSERT_TRUE(irq_is_enabled());

            adc_enable_nvic_irq(false);
            TEST_ASSERT_FALSE(irq_is_enabled());
        }

        void temp_sensor_power_toggles_tsvrefe() {
            adc_power_on_temp_sensor(true);
            TEST_ASSERT_TRUE(ADC->CCR & ADC_CCR_TSVREFE);

            adc_power_on_temp_sensor(false);
            TEST_ASSERT_FALSE(ADC->CCR & ADC_CCR_TSVREFE);
        }

        void oneshot_regular_group_completes_within_12_bit_range() {
            reset_to_baseline();

